/*-------------------------------------------------*/
/*         超纬电子STM32F407ZGT6开发板             */
/*    淘宝地址： http://chaoweidianzi.taobao.com   */
/*-------------------------------------------------*/
/*-------------------------------------------------*/
/*              TCP服务器头文件                    */
/*-------------------------------------------------*/
/*-------------------------------------------------*/
#ifndef __TCP_SERVER_H
#define __TCP_SERVER_H

#include "main.h"

#define TCP_SERVER_PORT   5050//本地服务器端口

void TCP_server_init(void);

#endif
