/*-------------------------------------------------*/
/*         超纬电子STM32F407ZGT6开发板             */
/*    淘宝地址： http://chaoweidianzi.taobao.com   */
/*-------------------------------------------------*/
/*-------------------------------------------------*/
/*            BH1750源文件,有3个函数               */
/*-------------------------------------------------*/
/*void Write_BH1750(u8 REG_Address);  写BH1750     */
/*void Read_BH1750(void);             读BH1750     */
/*void Start_BH1750(void);            开始采集数据 */
/*-------------------------------------------------*/

#include "bh1750.h" 
#include "iic.h"
#include "delay.h"

u8 BUF[8];    //数据buff缓冲区

/*-------------------------------------------------*/
/*函数名：写BH1750                                 */
/*参  数：REG_Address：地址                        */
/*返回值：无                                       */
/*-------------------------------------------------*/
void Write_BH1750(u8 REG_Address)
{
    IIC_Start();                  //起始信号
    IIC_Send_Byte(0x46);   //发送设备地址+写信号
	if(IIC_Wait_Ack())printf("等待应答超时1\r\n");
    IIC_Send_Byte(REG_Address);    //内部寄存器地址，
    if(IIC_Wait_Ack())printf("等待应答超时2\r\n");
    IIC_Stop();                   //发送停止信号
}

/*-------------------------------------------------*/
/*函数名：读BH1750                                 */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void Read_BH1750(void)
{   	
    IIC_Start();             //起始信号
    IIC_Send_Byte(0x47);     //发送设备地址+读信号
	if(IIC_Wait_Ack())printf("等待应答超时3\r\n");
	BUF[0]=IIC_Read_Byte(1);  //发送ACK
	BUF[1]=IIC_Read_Byte(0);  //发送NACK
    IIC_Stop();               //停止信号
    delay_ms(5);
}

/*-------------------------------------------------*/
/*函数名：开启数据采集                             */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void Start_BH1750(void)
{
	IIC_Init();              //IIc总线初始化
	Write_BH1750(0x01);	 //上电
	Write_BH1750(0x10);  //一次H分辨率模式，至少120ms，之后自动断电模式  
}
