/*-------------------------------------------------*/
/*         超纬电子STM32F407ZGT6开发板             */
/*    淘宝地址： http://chaoweidianzi.taobao.com   */
/*-------------------------------------------------*/
/*-------------------------------------------------*/
/*        硬件随机数发生器源文件,有2个函数         */
/*-------------------------------------------------*/
/* u8  RNG_Init(void);			  随机数始化       */
/* u32 RNG_Get_RandomNum(void);   得到随机数       */
/*-------------------------------------------------*/

#include "rng.h"
#include "delay.h"

/*-------------------------------------------------*/
/*函数名：初始化硬件随机数发生器                   */
/*参  数：无                                       */
/*返回值：1：出错  0：正确                         */
/*-------------------------------------------------*/
u8 RNG_Init(void)
{
	u16 timeout=0; 

	RCC_AHB2PeriphClockCmd(RCC_AHB2Periph_RNG, ENABLE);             //开启随机数时钟
	RNG_Cmd(ENABLE);	                                            //使能随机数

	while(RNG_GetFlagStatus(RNG_FLAG_DRDY)==RESET&&timeout<10000)	//等待随机数就绪
	{
		timeout++;                                                  //超时计数器+1      
		delay_ms(1);                                                //延时1ms
	}
	if(timeout>=10000)return 1;                                     //10s的超时时间，出错返回1
	return 0;                                                       //正确返回0
}

/*-------------------------------------------------*/
/*函数名：得到随机数                               */
/*参  数：无                                       */
/*返回值：得到的随机数                             */
/*-------------------------------------------------*/
u32 RNG_Get_RandomNum(void)
{	 
	while(RNG_GetFlagStatus(RNG_FLAG_DRDY)==RESET);	//等待随机数就绪  
	return RNG_GetRandomNumber();	                //返回随机数
}

